/**
 * @公司名称：YUTONG
 * @作者：zhangzhia
 * @版本号：1.0
 * @生成日期：2013-10-31 上午11:42:54
 * @功能描述：
 */
package com.yutong.clw.ygbclient.common.enums;

/**
 * 业务错误码类型
 * 
 * @author zhangzhia 2013-10-31 上午11:42:54
 */
public enum ErrorInfoType
{
    /**
     * 未知错误
     */
    Unknow(0, "未知错误"),
    /**
     * 终端上传信息异常，请求信息缺少必要参数信息
     */
    _10001(10001, "请求信息缺少必要参数信息"),
    /**
     * 终端上传信息异常，请求参数不符合规范
     */
    _10002(10002, "请求参数不符合规范"),
    /**
     * 终端请求参数开始时间大于结束时间
     */
    _10003(10003, "终端请求参数开始时间大于结束时间"),
    /**
     * 未找到需要的信息
     */
    _10010(10010, "未找到需要的信息"),
    /**
     * 未找到需要的信息
     */
    _10012(10012, "员工号不存在"),
    /**
     * 用户名或密码错误
     */
    _10102(10102, "用户名或密码错误"),
    /**
     * 数据的版本信息错误
     */
    _10103(10103, "数据的版本信息错误"),
    /**
     * 员工推送规则为空
     */
    _10104(10104, "员工推送规则为空"),
    /**
     * 终端持有的信息为最新，不需更新
     */
    _10105(10105, "终端持有的信息为最新，不需更新"),
    /**
     * 请求信息中无access_token信息  
     */
    _20000(20000, "登陆已失效，请退出后重新登录"),
    /**
     * 员工令牌异常
     */
    _20001(20001, "员工令牌异常"),
    /**
     * 服务器内部异常
     */
    _90000(90000, "服务器内部异常"),
    /**
     * 服务器内部异常，原因未知
     */
    _99999(99999, "服务器内部异常，原因未知"),
    /**
     * 邮箱错误
     */
    _10023(10023, "邮箱错误"),
    /**
     * 学生已绑定
     */
    _10020(10023, "学生已绑定"),
    /**
     * 手机已注册
     */
    _10021(10021, "手机已注册"),
    /**
     * 密码修改失败
     */
    _10022(10022, "密码修改失败"),
    /**
     * 保存信息失败
     */
    _10024(10024, "保存信息失败"),
    /**
     * 手机号错误
     */
    _10025(10025, "手机号错误"),
    /**
     * 用户已授权
     */
    _10026(10026, "用户已授权"),
    /**
     * 用户不存在
     */
    _10027(10027, "用户不存在"),
    /**
     * 用户名已经注册
     */
    _10028(10028, "用户名已经注册"),
    /**
     * 资源不存在
     */
    _10029(10029, "资源不存在"),
    /**
     * 旧密码验证错误
     */
    _10030(10030, "旧密码验证错误");

    private int _value;

    private String _name;

    private ErrorInfoType(int value, String name)
    {
        _value = value;
        _name = name;
    }

    public int value()
    {
        return _value;
    }

    public String getName()
    {
        return _name;
    }

    public static ErrorInfoType myValueOf(int value)
    {
        switch (value)
        {
        case 10002:
            return _10002;

        case 10003:
            return _10003;

        case 10010:
            return _10010;

        case 10102:
            return _10102;

        case 10103:
            return _10103;

        case 10104:
            return _10104;

        case 10105:
            return Unknow;

        case 20000:
            return _20000;

        case 20001:
            return _20001;

        case 90000:
            return _90000;

        case 99999:
            return _99999;

        case 10023:
            return _10023;

        case 10020:
            return _10020;

        case 10021:
            return _10021;

        case 10022:
            return _10022;

        case 10024:
            return _10024;

        case 10025:
            return _10025;

        case 10026:
            return _10026;

        case 10027:
            return _10027;

        case 10028:
            return _10028;

        case 10029:
            return _10029;

        case 10030:
            return _10030;
            
        case 10012:
            return _10012;

        default:
            return Unknow;
        }
    }
}
